---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RgbRParam
source: html/e1deecca-ddbf-fd40-587f-213207915080.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RgbRParam Property

"Red value for RGB color spec. (for Use with XAML Data Template example)"

## Syntax (C#)
```csharp
public static ForgeTypeId RgbRParam { get; }
```